"use strict";

(self.webpackChunktradingview = self.webpackChunktradingview || []).push([[2521], {
  12978: function _(e) {
    e.exports = ["Данные в реальном времени для {symbolName}"];
  },
  64565: function _(e) {
    e.exports = ["предоставлены биржей {exchange}."];
  },
  19801: function _(e) {
    e.exports = ["Пт"];
  },
  11268: function _(e) {
    e.exports = ["Пн"];
  },
  63331: function _(e) {
    e.exports = ["Сб"];
  },
  85954: function _(e) {
    e.exports = ["Вс"];
  },
  26230: function _(e) {
    e.exports = ["Ср"];
  },
  24793: function _(e) {
    e.exports = ["Чт"];
  },
  31533: function _(e) {
    e.exports = ["Вт"];
  },
  89790: function _(e) {
    e.exports = ["Не удалось получить исходный код Pine."];
  },
  39589: function _(e) {
    e.exports = ["Свернуть панель"];
  },
  38154: function _(e) {
    e.exports = ["Подтвердить удаление дерева индикаторов"];
  },
  53205: function _(e) {
    e.exports = ["Непрерывные фьючерсные контракты"];
  },
  15993: function _(e) {
    e.exports = ["Непрерывные фьючерсные контракты — это синтетический финансовый инструмент, получаемый путем объединения нескольких индивидуальных фьючерсных контрактов. 1! — контракт ближайшего (или самого скорого) месяца исполнения, а 2! — контракт второго ближайшего месяца исполнения."];
  },
  45e3: function _(e) {
    e.exports = ["Cboe BZX"];
  },
  36004: function _(e) {
    e.exports = ["Создайте бесплатный профиль"];
  },
  69419: function _(e) {
    e.exports = ["Всё в порядке — рынок открыт."];
  },
  97637: function _(e) {
    e.exports = ["Апрель"];
  },
  86797: function _(e) {
    e.exports = ["Август"];
  },
  22519: function _(e) {
    e.exports = ["Значения изменения бара"];
  },
  52003: function _(e) {
    e.exports = ["Вы действительно хотите удалить этот индикатор и все связанные с ним расчёты?"];
  },
  68854: function _(e) {
    e.exports = ["Двойное нажатие"];
  },
  97325: function _(e) {
    e.exports = ["Проблема с данными"];
  },
  52916: function _(e) {
    e.exports = ["Данные обновляются один раз в день."];
  },
  25978: function _(e) {
    e.exports = ["Данные обновляются один раз в секунду, даже если обновлений на рынке было больше."];
  },
  57310: function _(e) {
    e.exports = ["Данные c задержкой"];
  },
  49321: function _(e) {
    e.exports = ["Данные, предоставляемые с подпиской Basic, обновляются один раз в секунду, даже если обновлений на рынке было больше."];
  },
  55669: function _(e) {
    e.exports = ["Декабрь"];
  },
  83498: function _(e) {
    e.exports = ["Удалить панель"];
  },
  6044: function _(e) {
    e.exports = ["Производные данные"];
  },
  31461: function _(e) {
    e.exports = ["Производные данные относятся к финансовым показателям, которые создаются путём объединения и/или обработки исходных данных, поступающих из различных источников."];
  },
  59315: function _(e) {
    e.exports = ["Обновление раз в день"];
  },
  82751: function _(e) {
    e.exports = ["Ошибка"];
  },
  40519: function _(e) {
    e.exports = ["Сейчас вечер. Рынок открыт для торговли в вечернюю сессию."];
  },
  80227: function _(e) {
    e.exports = ["Часовой пояс биржи"];
  },
  16467: function _(e) {
    e.exports = ["Февраль"];
  },
  25046: function _(e) {
    e.exports = ["Заполнить биржевые соглашения"];
  },
  93666: function _(e) {
    e.exports = ["Отметить символ"];
  },
  564: function _(e) {
    e.exports = ["Пт"];
  },
  72970: function _(e) {
    e.exports = ["Пятница"];
  },
  88958: function _(e) {
    e.exports = ["Выходной день"];
  },
  32960: function _(e) {
    e.exports = ["Халяльный инструмент"];
  },
  21686: function _(e) {
    e.exports = ["Скрыть информацию об индикаторах"];
  },
  26935: function _(e) {
    e.exports = ["Параметры индикатора"];
  },
  26315: function _(e) {
    e.exports = ["Названия индикаторов"];
  },
  84098: function _(e) {
    e.exports = ["Значения индикатора"];
  },
  91459: function _(e) {
    e.exports = ["Если вам нужны данные в реальном времени для {listedExchange}, то заполните биржевое соглашение. Не беспокойтесь, это можно сделать в несколько кликов"];
  },
  50634: function _(e) {
    e.exports = ["Вечерняя сессия начнется через {remainingTime}."];
  },
  74537: function _(e) {
    e.exports = ["Предторговый период начнется через {remainingTime}."];
  },
  26910: function _(e) {
    e.exports = ["Январь"];
  },
  23230: function _(e) {
    e.exports = ["Июль"];
  },
  49385: function _(e) {
    e.exports = ["Июнь"];
  },
  99487: function _(e) {
    e.exports = ["Значения ОТКР-МАКС-МИН-ЗАКР"];
  },
  15815: function _(e) {
    e.exports = ["Обновляются раз в секунду"];
  },
  90784: function _(e) {
    e.exports = ["Октябрь"];
  },
  75991: function _(e) {
    e.exports = ["Cтатус Рынок открыт"];
  },
  36051: function _(e) {
    e.exports = ["Узнать больше"];
  },
  39899: function _(e) {
    e.exports = ["Переместить вниз"];
  },
  70343: function _(e) {
    e.exports = ["Переместить вверх"];
  },
  83085: function _(e) {
    e.exports = ["Пн"];
  },
  61199: function _(e) {
    e.exports = ["Понедельник"];
  },
  41610: function _(e) {
    e.exports = ["Ещё"];
  },
  1653: function _(e) {
    e.exports = ["Сейчас утро. Рынок открыт для торговли в предторговый период."];
  },
  56470: function _(e) {
    e.exports = ["Развернуть график"];
  },
  19603: function _(e) {
    e.exports = ["Развернуть панель"];
  },
  68327: function _(e) {
    e.exports = ["Май"];
  },
  35732: function _(e) {
    e.exports = ["Настройки панели"];
  },
  84675: function _(e) {
    e.exports = ["Март"];
  },
  83949: function _(e) {
    e.exports = ["Рынок открыт"];
  },
  35701: function _(e) {
    e.exports = ["Рынок открывается через {remainingTime}."];
  },
  95814: function _(e) {
    e.exports = ["Рынок закрыт"];
  },
  98105: function _(e) {
    e.exports = ["Рынок закрывается через {remainingTime}."];
  },
  56086: function _(e) {
    e.exports = ["На рынке сегодня праздничный день. Повезло им."];
  },
  71194: function _(e) {
    e.exports = ["Ноябрь"];
  },
  66324: function _(e) {
    e.exports = ["Исходный код"];
  },
  36835: function _(e) {
    e.exports = ["Сб"];
  },
  1144: function _(e) {
    e.exports = ["Суббота"];
  },
  40653: function _(e) {
    e.exports = ["Прокрутить влево"];
  },
  26721: function _(e) {
    e.exports = ["Прокрутить до текущего бара"];
  },
  35809: function _(e) {
    e.exports = ["Прокрутить вправо"];
  },
  61132: function _(e) {
    e.exports = ["Сентябрь"];
  },
  28705: function _(e) {
    e.exports = ["Показать информацию об индикаторах"];
  },
  51072: function _(e) {
    e.exports = ["Показать дерево объектов"];
  },
  37809: function _(e) {
    e.exports = ["Показывать настройки интервала"];
  },
  39045: function _(e) {
    e.exports = ["Ошибка индикатора или стратегии"];
  },
  86577: function _(e) {
    e.exports = ["Вс"];
  },
  72149: function _(e) {
    e.exports = ["Воскресенье"];
  },
  46041: function _(e) {
    e.exports = ["Источник ценовых данных инструмента"];
  },
  63143: function _(e) {
    e.exports = ["Имя инструмента"];
  },
  29985: function _(e) {
    e.exports = ["Вечерняя торговая сессия"];
  },
  28412: function _(e) {
    e.exports = ["В платные подписки включено более частое обновление данных."];
  },
  56042: function _(e) {
    e.exports = ["Предторговый период"];
  },
  24680: function _(e) {
    e.exports = ["Первичный листинг"];
  },
  89022: function _(e) {
    e.exports = ["В настоящий момент данные в реальном времени для этого инструмента не поддерживаются. Но это может измениться в будущем."];
  },
  6667: function _(e) {
    e.exports = ["Данные в реальном времени для {symbolName} предоставлены биржей {exchange}."];
  },
  48293: function _(e) {
    e.exports = ["Восстановить график"];
  },
  91029: function _(e) {
    e.exports = ["Восстановить панель"];
  },
  75094: function _(e) {
    e.exports = ["Ср"];
  },
  7147: function _(e) {
    e.exports = ["Среда"];
  },
  52984: function _(e) {
    e.exports = ["Чтобы получать данные в реальном времени для {description}, вам нужно купить подписку на данные в реальном времени."];
  },
  9787: function _(e) {
    e.exports = ["Чт"];
  },
  7951: function _(e) {
    e.exports = ["Четверг"];
  },
  99214: function _(e) {
    e.exports = ["Основная, или первая, фондовая биржа, на которой торгуются акции компании."];
  },
  2310: function _(e) {
    e.exports = ['Эти данные обновляются в реальном времени, но они могут немного отличаться от аналогичных "официальных" данных от основных бирж.'];
  },
  29512: function _(e) {
    e.exports = ['Эти данные обновляются в реальном времени, но они могут немного отличаться от аналогичных "официальных" данных от {exchange}.'];
  },
  52449: function _(e) {
    e.exports = ["Акции соответствуют принципам шариата, т.е. не противоречат нормам ислама. Данная компания не взимает и не получает проценты, а также не взаимодействует с некоторыми секторами (азартные игры, алкогольная и табачная продукция, продукты питания из свинины)."];
  },
  73717: function _(e) {
    e.exports = ["Этот символ не существует, пожалуйста, выберите другой."];
  },
  57048: function _(e) {
    e.exports = ["Можно прогуляться — этот рынок сейчас закрыт."];
  },
  94316: function _(e) {
    e.exports = ["Вт"];
  },
  44979: function _(e) {
    e.exports = ["Вторник"];
  },
  8209: function _(e) {
    e.exports = ["Снять отметку с символа"];
  },
  1111: function _(e) {
    e.exports = ["Объём"];
  },
  61311: function _(e) {
    e.exports = ["Увеличить масштаб"];
  },
  47602: function _(e) {
    e.exports = ["Уменьшить масштаб"];
  },
  57889: function _(e) {
    e.exports = ["изменение видимости значений ОТКР-МАКС-МИН-ЗАКР"];
  },
  18644: function _(e) {
    e.exports = ["изменение видимости статуса: Рынок открыт"];
  },
  45110: function _(e) {
    e.exports = ["изменение видимости значения изменения бара"];
  },
  31325: function _(e) {
    e.exports = ["изменение видимости названий индикаторов"];
  },
  99774: function _(e) {
    e.exports = ["изменение видимости значений индикаторов"];
  },
  96162: function _(e) {
    e.exports = ["изменение видимости параметров индикаторов"];
  },
  26717: function _(e) {
    e.exports = ["изменение видимости описания инструмента"];
  },
  6091: function _(e) {
    e.exports = ["изменение видимости поля символа"];
  },
  9455: function _(e) {
    e.exports = ["изменение видимости значений объема"];
  },
  39348: function _(e) {
    e.exports = ["меньше минуты"];
  },
  87358: function _(e) {
    e.exports = ["отображение: {title}"];
  },
  7827: function _(e) {
    e.exports = ["{days} и {hours}"];
  },
  7435: function _(e) {
    e.exports = ["{exchange} от {originalExchange}"];
  },
  19830: function _(e) {
    e.exports = ["{hours} и {minutes}"];
  },
  1084: function _(e) {
    e.exports = ["Данные в реальном времени для {listedExchange} доступны бесплатно для зарегистрированных пользователей."];
  },
  11155: function _(e) {
    e.exports = ["{symbolName} данные с задержкой на {time} минут."];
  },
  77033: function _(e) {
    e.exports = ["Данные обновляются один раз в {amount} секунду, даже если событий на рынке было больше.", "Данные обновляются один раз в {amount} секунды, даже если событий на рынке было больше.", "Данные обновляются один раз в {amount} секунд, даже если событий на рынке было больше.", "Данные обновляются один раз в {amount} секунд, даже если событий на рынке было больше."];
  },
  2121: function _(e) {
    e.exports = ["Данные, предоставляемые с подпиской Basic, обновляются один раз в {amount} секунду, даже если событий на рынке было больше.", "Данные, предоставляемые с подпиской Basic, обновляются один раз в {amount} секунды, даже если событий на рынке было больше.", "Данные, предоставляемые с подпиской Basic, обновляются один раз в {amount} секунд, даже если событий на рынке было больше.", "Данные, предоставляемые с подпиской Basic, обновляются один раз в {amount} секунд, даже если событий на рынке было больше."];
  },
  5223: function _(e) {
    e.exports = ["Данные обновляются один раз в {amount} секунду", "Данные обновляются один раз в {amount} секунды", "Данные обновляются один раз в {amount} секунд", "Данные обновляются один раз в {amount} секунд"];
  },
  58609: function _(e) {
    e.exports = ["{number} день", "{number} дня", "{number} дней", "{number} дней"];
  },
  24430: function _(e) {
    e.exports = ["{number} час", "{number} часа", "{number} часов", "{number} часов"];
  },
  67151: function _(e) {
    e.exports = ["{number} минута", "{number} минуты", "{number} минут", "{number} минут"];
  }
}]);