"use strict";

(self.webpackChunktradingview = self.webpackChunktradingview || []).push([[6196], {
  22353: function _(e) {
    e.exports = ["(ОТКР+МАКС+МИН+ЗАКР)/4"];
  },
  94884: function _(e) {
    e.exports = ["(МАКС+МИН+ЗАКР)/3"];
  },
  10591: function _(e) {
    e.exports = ["(МАКС+МИН)/2"];
  },
  63243: function _(e) {
    e.exports = ["Цвет баров основан на цене предыдущего закрытия"];
  },
  15857: function _(e) {
    e.exports = ["Линия закрытия"];
  },
  9994: function _(e) {
    e.exports = ["Корректировать данные на дивиденды"];
  },
  10989: function _(e) {
    e.exports = ["Корректировать с учётом изменений контрактов"];
  },
  70816: function _(e) {
    e.exports = ["Средняя цена закрытия"];
  },
  50430: function _(e) {
    e.exports = ["Нижняя линия"];
  },
  83760: function _(e) {
    e.exports = ["Тело"];
  },
  72269: function _(e) {
    e.exports = ["Границы"];
  },
  7445: function _(e) {
    e.exports = ["Уровень базовой линии"];
  },
  47586: function _(e) {
    e.exports = ["Цены покупки и продажи"];
  },
  39667: function _(e) {
    e.exports = ["Нисходящие бары"];
  },
  87151: function _(e) {
    e.exports = ["Цвет падения"];
  },
  81285: function _(e) {
    e.exports = ["Настройка данных"];
  },
  4329: function _(e) {
    e.exports = ["Не задано"];
  },
  86846: function _(e) {
    e.exports = ["Заливка"];
  },
  58747: function _(e) {
    e.exports = ["Заливка области сверху"];
  },
  11157: function _(e) {
    e.exports = ["Заливка области снизу"];
  },
  86953: function _(e) {
    e.exports = ["Не отображать цену открытия"];
  },
  39292: function _(e) {
    e.exports = ["Макс. и мин."];
  },
  83678: function _(e) {
    e.exports = ["Линия максимума"];
  },
  75310: function _(e) {
    e.exports = ["Линия минимума"];
  },
  15107: function _(e) {
    e.exports = ["Посл. цена"];
  },
  6350: function _(e) {
    e.exports = ["Пре-/постмаркет"];
  },
  62521: function _(e) {
    e.exports = ["Фон пре-/постмаркета"];
  },
  73947: function _(e) {
    e.exports = ["Точность"];
  },
  8094: function _(e) {
    e.exports = ["Цена закрытия предыдущего дня"];
  },
  77986: function _(e) {
    e.exports = ["Ценовые линии"];
  },
  24248: function _(e) {
    e.exports = ["На основе"];
  },
  94089: function _(e) {
    e.exports = ["Проекция восходящего бара"];
  },
  80293: function _(e) {
    e.exports = ["Проекция свечей"];
  },
  5704: function _(e) {
    e.exports = ["Проекция нисходящего бара"];
  },
  29881: function _(e) {
    e.exports = ["Реальные цены на ценовой шкале (вместо значений Хейкен Аши)"];
  },
  57417: function _(e) {
    e.exports = ["Верхняя линия"];
  },
  55314: function _(e) {
    e.exports = ["Тонкие бары"];
  },
  87492: function _(e) {
    e.exports = ["Часовой пояс"];
  },
  5536: function _(e) {
    e.exports = ["Цвет роста"];
  },
  83610: function _(e) {
    e.exports = ["Восходящие бары"];
  },
  99983: function _(e) {
    e.exports = ["Использовать расчетную цену для цены закрытия на дневном интервале"];
  },
  30792: function _(e) {
    e.exports = ["свечи"];
  },
  55740: function _(e) {
    e.exports = ["изменение баров МАКС-МИН-ЗАКР"];
  },
  68927: function _(e) {
    e.exports = ["изменение ширины линии средней цены закрытия"];
  },
  30385: function _(e) {
    e.exports = ["изменение цвета линии средней цены закрытия"];
  },
  97008: function _(e) {
    e.exports = ["изменение цвета заливки области"];
  },
  6610: function _(e) {
    e.exports = ["изменение толщины линии области"];
  },
  661: function _(e) {
    e.exports = ["изменение цвета линии области"];
  },
  1316: function _(e) {
    e.exports = ["изменение источника ценовых данных области"];
  },
  29180: function _(e) {
    e.exports = ["изменение цвета линии цены покупки"];
  },
  31547: function _(e) {
    e.exports = ["изменение уровня базовой линии"];
  },
  4164: function _(e) {
    e.exports = ["изменение цвета нижней линии базовой линии"];
  },
  38990: function _(e) {
    e.exports = ["изменение толщины нижней линии базовой линии"];
  },
  73163: function _(e) {
    e.exports = ["изменение цвета заливки нижней области базовой линии"];
  },
  12673: function _(e) {
    e.exports = ["изменение цвета заливки верхней области базовой линии"];
  },
  56819: function _(e) {
    e.exports = ["изменение источника ценовых данных базовой линии"];
  },
  68621: function _(e) {
    e.exports = ["изменение цвета верней линии базовой линии"];
  },
  35339: function _(e) {
    e.exports = ["изменение ширины верней линии базовой линии"];
  },
  76804: function _(e) {
    e.exports = ["изменение цвета восходящих баров"];
  },
  71816: function _(e) {
    e.exports = ["изменение цвета нисходящих баров"];
  },
  36703: function _(e) {
    e.exports = ["изменение цвета линии цены продажи"];
  },
  29353: function _(e) {
    e.exports = ["изменение цвета баров на основе цен предыдущего закрытия"];
  },
  85709: function _(e) {
    e.exports = ["изменение цвета восходящих столбцов"];
  },
  12155: function _(e) {
    e.exports = ["изменение цвета нисходящих столбцов"];
  },
  66890: function _(e) {
    e.exports = ["изменение источника ценовых данных столбцов"];
  },
  71809: function _(e) {
    e.exports = ["изменение десятичных знаков"];
  },
  31317: function _(e) {
    e.exports = ["изменение цвета расширенных сессий"];
  },
  60944: function _(e) {
    e.exports = ["изменение цвета линий макс. и мин. цен"];
  },
  83708: function _(e) {
    e.exports = ["изменение ширины линий макс. и мин. цен"];
  },
  81080: function _(e) {
    e.exports = ["изменение цвета тела МАКС-МИН"];
  },
  30033: function _(e) {
    e.exports = ["изменение видимости тела МАКС-МИН"];
  },
  76885: function _(e) {
    e.exports = ["изменение цвета границ МАКС-МИН"];
  },
  79236: function _(e) {
    e.exports = ["изменение видимости границ МАКС-МИН"];
  },
  42981: function _(e) {
    e.exports = ["изменение видимости меток МАКС-МИН"];
  },
  31937: function _(e) {
    e.exports = ["изменение цвета меток МАКС-МИН"];
  },
  87828: function _(e) {
    e.exports = ["изменение цвета линии"];
  },
  17119: function _(e) {
    e.exports = ["изменение источника ценовых данных линии"];
  },
  69125: function _(e) {
    e.exports = ["изменение толщины линии"];
  },
  49973: function _(e) {
    e.exports = ["изменение цвета постмаркета"];
  },
  5969: function _(e) {
    e.exports = ["изменение цвета линии постмаркета"];
  },
  50393: function _(e) {
    e.exports = ["изменение видимости линий цены пре-/постмаркета"];
  },
  46257: function _(e) {
    e.exports = ["изменение цвета премаркета"];
  },
  60852: function _(e) {
    e.exports = ["изменение цвета линии премаркета"];
  },
  91183: function _(e) {
    e.exports = ["изменение цвета линии цены предыдущего закрытия"];
  },
  87631: function _(e) {
    e.exports = ["изменение толщины линии цены предыдущего закрытия"];
  },
  77640: function _(e) {
    e.exports = ["изменение цвета линии цены"];
  },
  97322: function _(e) {
    e.exports = ["изменение толщины линии цены"];
  },
  35116: function _(e) {
    e.exports = ["изменение стиля Range баров"];
  },
  28143: function _(e) {
    e.exports = ["изменение тонких range баров"];
  },
  75986: function _(e) {
    e.exports = ["изменение цвета фитиля нисходящих свечей на графике Ренко"];
  },
  7747: function _(e) {
    e.exports = ["изменение цвета фитиля восходящих свечей на графике Ренко"];
  },
  9473: function _(e) {
    e.exports = ["изменение видимости фитиля свечей на графике Ренко"];
  },
  39783: function _(e) {
    e.exports = ["изменение отображения реальных цен на ценовой шкале (вместо значений Хейкен Аши)"];
  },
  72886: function _(e) {
    e.exports = ["изменение тонких баров"];
  },
  5464: function _(e) {
    e.exports = ["изменение цвета границы восходящих свечей: {candleType}"];
  },
  61118: function _(e) {
    e.exports = ["изменение цвета тела восходящих свечей: {candleType}"];
  },
  60164: function _(e) {
    e.exports = ["изменение цвета фитиля нисходящих свечей: {candleType}"];
  },
  45543: function _(e) {
    e.exports = ["изменение цвета фитиля восходящих свечей: {candleType}"];
  },
  39987: function _(e) {
    e.exports = ["изменение видимости фитиля {candleType}"];
  },
  47202: function _(e) {
    e.exports = ["изменение видимости тела свечи: {candleType}"];
  },
  23986: function _(e) {
    e.exports = ["изменение видимости границы {candleType}"];
  },
  92330: function _(e) {
    e.exports = ["изменение цвета границы нисходящих свечей: {candleType}"];
  },
  36320: function _(e) {
    e.exports = ["изменение цвета тела нисходящих свечей: {candleType}"];
  },
  79088: function _(e) {
    e.exports = ["изменение цвета границы нисходящих баров {chartType}"];
  },
  11107: function _(e) {
    e.exports = ["изменение цвета границы восходящих баров {chartType}"];
  },
  85503: function _(e) {
    e.exports = ["изменение цвета нисходящих баров графика {chartType}"];
  },
  61250: function _(e) {
    e.exports = ["изменение цвета границы проекции восходящих баров {chartType}"];
  },
  18465: function _(e) {
    e.exports = ["изменение цвета проекции нисходящих баров {chartType}"];
  },
  50453: function _(e) {
    e.exports = ["изменение цвета проекции восходящих баров {chartType}"];
  },
  59414: function _(e) {
    e.exports = ["изменение цвета восходящих баров графика {chartType}"];
  },
  21547: function _(e) {
    e.exports = ["изменение свойств {inputName}"];
  },
  42390: function _(e) {
    e.exports = ["корректировку данных на дивиденды"];
  },
  99511: function _(e) {
    e.exports = ["корректировку с учетом изменений контрактов"];
  },
  75165: function _(e) {
    e.exports = ["Пустые свечи"];
  },
  18995: function _(e) {
    e.exports = "range";
  },
  47500: function _(e) {
    e.exports = ["Ренко"];
  },
  98402: function _(e) {
    e.exports = ["использование расчетной цены для цены закрытия на дневном интервале"];
  }
}]);